# TODO Код Морзе для представления цифр и букв использует тире и точки. Напишите функцию для
#  кодирования текстового сообщения в соответствии с кодом Морзе.

morze_dict = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....',
              'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.',
              'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
              'Y': '-.--', 'Z': '--..', ' ': '  ', '0': '-----', '1': '.----', '2': '..---', '3': '...--',
              '4': '....-', '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.'}


def encrypter(text):
    symbols = []

    for i in text.upper():
        symbol = morze_dict.get(i)
        symbols.append(symbol)
    return ' '.join(symbols)


initial_text = input()
encrypter(initial_text)
print(encrypter(initial_text))
